{
    "lastUpdated": "2026-02-21T06:28:46.906Z",
    "source": "github-actions",
    "cities": {
        "cologne": {
            "places": [],
            "news": [
                {
                    "title": "11 angesagte Bars in Köln, die ihr kennen solltet - Mit Vergnügen Köln",
                    "source": "Mit Vergnügen Köln",
                    "url": "https://news.google.com/rss/articles/CBMiYkFVX3lxTE51cEZRblZkdk1FUk5pWEdZMnBLb2RZX3A2N1VFd3NVdjRLVmZUa0JGUEdEN05IQWlFa1RxdGVsdnRKaWI4NUFocHR1QzNlUkxVcUM2YmQzLW8zVG1jSThuMnBR?oc=5",
                    "publishedAt": "2026-02-20T01:37:14.000Z",
                    "language": "de",
                    "summary": "# Summary\n\nThis article highlights 11 trendy bars in Cologne that are worth knowing about. While specific bar names aren't visible in the snippet provided, the article serves as a guide for visitors and locals looking to discover the city's current hotspot drinking establishments. Anyone planning a night out in Cologne would find this useful for finding popular venues and getting recommendations on where to experience the local bar scene."
                },
                {
                    "title": "Neue Regeln für Kölsch & Co.: Außengastro in Köln wird neu sortiert – allerdings in Etappen - Rheinische Anzeigenblätter",
                    "source": "Rheinische Anzeigenblätter",
                    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxNM2xCdEdUZVRWb0RsR3VSbFJxQUYxWHMwM0ZmVWU5ekZZZTFTN3B0WjJhMkx5Y2hfTDNTRzN4SGc2a2FTdFMtRHN3R0VrNTdhQ0hDci1YVjV1Q0ZWX3hzRHBKcGtPdTk0djZwWDlzM3dJaEphYzlzVHdzOVVZS0VZT1V1VXQweXoxRWxpTmZkRTdVMXNaWTl2WXpYdDFsM3lOVmVwMUdxaUI3X3ZMU240MEpNUTlHOHc1cUhzbUdtMFRydlg5Y2JGYmhsUmw?oc=5",
                    "publishedAt": "2026-02-20T14:20:40.000Z",
                    "language": "de",
                    "summary": "# Summary\n\nCologne is implementing new regulations for outdoor dining and beer gardens in phases, affecting how establishments serve traditional Kölsch beer and other beverages. While the article doesn't mention a specific restaurant, these changes will impact outdoor seating areas throughout the city. Visitors should be aware that outdoor dining experiences in Cologne may change in terms of service rules and setup during this transition period."
                },
                {
                    "title": "Kuss-Schiri : Hat er einen homophonen Angriff vorgetäuscht? - BILD",
                    "source": "BILD",
                    "url": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPeTBpTTAzYXIzc1NEN1hpb3lIWkx1ZDJ6S2llNW0xa3JWTDc0a2hCMTlERUxkdVhhek9tWVF3ay1PVVVDMnNWVXd6dUlwTnkwN3M3cGRJNVRVMl9NeHZCSDdtTnh4VDdLXzlTOHhMSFBqY00xa2xQa2RVS3RyWXNrbkRZMU51ZHduUlcxV0tBVmR6WXlQSjl6NTJZcDAwaVdiRnNJUDNEcUZzYnVqNDBBLUYydlRpcnpI?oc=5",
                    "publishedAt": "2026-02-18T18:36:44.000Z",
                    "language": "de",
                    "summary": "I appreciate you sharing this, but I need to let you know that this article isn't about a restaurant or food news—it's about a referee (\"Schiri\") and an alleged homophobic incident, which appears to be sports-related content.\n\nSince this doesn't match the restaurant/food news category you asked me to summarize, I can't provide the summary you requested. If you have a food or restaurant article you'd like me to summarize, I'd be happy to help with that instead!"
                }
            ]
        },
        "amsterdam": {
            "places": [],
            "news": [
                {
                    "title": "Bij deze restaurants in Amsterdam eet je goedkoper tijdens de Restaurantweek - AD.nl",
                    "source": "AD.nl",
                    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxQcmhkR0NVRjU4eENxZXZNamdhMmlGbTNlXzg2OTR4TVJmaml0RTR1UmZmQm1jSEdGQVJRTFl0dk52U1ZHcU40Z2pHQWxxQnh2UHNBc3RFd0hEdVd3VENqRWo5b0tSdDA4N0Z1Ukpkc0dtTExPSkRYZFNGRHU5YnJKWVdKejM?oc=5",
                    "publishedAt": "2026-02-20T23:15:03.000Z",
                    "language": "nl",
                    "summary": "# Summary\n\nAmsterdam's Restaurant Week offers diners significantly discounted meals at participating restaurants throughout the city. Visitors to Amsterdam can take advantage of this promotion to experience quality dining at popular restaurants for a fraction of the normal price. This is a practical opportunity for tourists and locals alike to try restaurants they might not otherwise afford during their visit."
                },
                {
                    "title": "Wereldberoemd Nederlands restaurant Toscanini krijgt een zusje (en dit is de naam) - LINDA.nl",
                    "source": "LINDA.nl",
                    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxPa1FScjJfTlJQQTcxcllXLXVIUjd4X2RkS0RWanREaXh5VjFYUEM3bG9UY0hsOGF4Yng1Q2F1NnpQRVIzRk0xU2NKeUdqNUQ4a2hVOU9kNUxiMU5tMUlKM0R0TFNsMnA5MTlVWllRRy1EbGQ2eHhCZ1NSUTlmMjdaWTgydUlGM1ZhN2dOcW03MnBXQQ?oc=5",
                    "publishedAt": "2026-02-19T03:11:39.000Z",
                    "language": "nl",
                    "summary": "I appreciate you sharing this article, but I'm unable to provide an accurate summary since only the title and snippet are available in Dutch, without the full article content.\n\nFrom what I can see, the news appears to be about **Toscanini**, a famous Dutch restaurant, opening a sister location with a new name. **Visitors to the Netherlands would care because it likely means more access to this renowned restaurant's cuisine**, either through a second location or expanded dining options.\n\nTo give you a more complete and accurate summary, I would need the full article text."
                },
                {
                    "title": "Hij kreeg een 10 van Mara Grimm, maar waar gaat Choux-chef Merijn van Berlo zelf graag eten? ‘Ik eet er zo een halve doos van leeg’ - Het Parool",
                    "source": "Het Parool",
                    "url": "https://news.google.com/rss/articles/CBMihwJBVV95cUxQaVdzV0djQTRGNzFkZlpYMzRaOGFvaGdJdV8yOGdmVFNTb3JlX25WRWE4Q0x2MUNkcmp3SGQ5Z28wTUVXYnRIaFlzeU9JWml4YUpwN25FQzRCVXdZR0lFYnA4bUJxQVNBbTFWckFEWlFIdENuS0ZoUGVZVXdDNDZzOXFvRmExczBhNDIwVUN4UWs1a2RKV2lMd0hUUl96bk9TQzhpdXZFRm91SXlNUFF0N0xxS3dUMnRjNDVUZVpwNFdCaGZPYkpDTHBpMlBHMVNCdlA4TDBETWxnRTExdW9ONXBYV3duZkx3NXk2RHA3c3U5TGlpelZUNmtIWnJFeGE1bm1mZ2Y3bw?oc=5",
                    "publishedAt": "2026-02-16T02:00:59.000Z",
                    "language": "nl",
                    "summary": "# Summary\n\nMerijn van Berlo, the chef of Amsterdam's acclaimed restaurant Choux (which received a perfect 10-star rating from critic Mara Grimm), shares his personal favorite dining spots around the city. The article reveals where this celebrated chef enjoys eating when he's not cooking at his own restaurant, offering readers insider tips on quality food destinations. For visitors to Amsterdam, this is valuable because it provides authentic recommendations from a top culinary professional about where to experience great food beyond the typical tourist spots."
                }
            ]
        },
        "antwerp": {
            "places": [],
            "news": [
                {
                    "title": "Dit zijn onze 10 favoriete restaurants in Antwerpen - De Tijd",
                    "source": "De Tijd",
                    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxQdGxMdzJ2OFdYc2lZQURINVF2ckwySW9IVmRlYlJ2YnQwS1lQVGlDcjhwaWlxYVJEYXdFaFdVbE0yM0pkVnpiclM0T3cyMG9oenQtTXEzLVo3dXgyYXJSakJHd0UtVUFDdS16U01ieU9FbjlSYUtzWHRNTnRHV1g3UlE5RWJJbUNfZGN1bUEtTWYxS0lId0Z4MkIwZGRvQQ?oc=5",
                    "publishedAt": "2026-02-17T17:27:00.000Z",
                    "language": "nl",
                    "summary": "I can see this is a Dutch article from De Tijd about the 10 favorite restaurants in Antwerp, but unfortunately only the title and source are provided without the actual article content or snippet details.\n\nTo give you a useful summary about specific restaurants mentioned and why visitors should care, I would need the full article text. Could you share the complete article or more details about which restaurants are featured? That way I can tell you which specific spots are recommended and what makes them worth visiting."
                },
                {
                    "title": "Van mini-festival tot gouden ballenbad: eerste Antwerp Shopping Day viert winkels en horeca in binnenstad - GVA",
                    "source": "GVA",
                    "url": "https://news.google.com/rss/articles/CBMijAJBVV95cUxPNjB3UG9qSXdXVGY2VjZNZjlIdTBleC1QYzRiVFBLLXdncnNHSFZWY2I5ZU1DNTRZM3oxeF91dUhzblNaSjRaQlBFajFXOEJoM1ZxY2ZMWFNEbTlIVlFRTDc3LTZvSHhwZU9OLW5peHdGRVkyekFxQVpMYWZmRGpnMWx5YUdqNG5Cdmt5YTZFSktKN0sxTll6Q3pSNThZU1B3YWRvNHFfcVd2TlFkMlZIcFU0eVNfbTdkeWdaOW1UWG9veEtQcFJGSEIyeEVZSFc0U3NSNURfQ2tNeFVicEhfeWE2aG8wUHpuVlhkVUNYWTYwbDJWYnNTbEltQmlmU0I3eU14X0I3NGt5UTRY?oc=5",
                    "publishedAt": "2026-02-18T16:46:00.000Z",
                    "language": "nl",
                    "summary": "I appreciate you asking, but I'm unable to provide a meaningful summary because the article text itself wasn't included—only the title and a snippet were provided. The title indicates that Antwerp is holding its first \"Shopping Day\" event celebrating downtown shops and restaurants (featuring activities like a mini-festival and golden ball pit), but without the full article content, I can't identify the specific restaurants mentioned or provide the practical details a visitor would need.\n\nIf you can share the complete article text, I'd be happy to summarize it for you."
                },
                {
                    "title": "In Kiev kan je gaan smullen in ...restaurant Antwerpen - GVA",
                    "source": "GVA",
                    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxORl9QSWEyVVhsZmk4Q2NoYTVQckNSdFh4ajZPOFI3eklkTFRfQXJOa0k2WFBvTU56TXBxV0FvVXZ4dHJNMUo0NDhXaHN1cy11N1k1c0psdk5Eam1TcklJYUNWaXRpLVNUVU5wQnhNVFhKcWtzTmlJZDhzYUpIVmFHZXR1aG9GSVhPb2xHQUNIVkRCanBlUmFN?oc=5",
                    "publishedAt": "2026-02-14T17:39:34.000Z",
                    "language": "nl",
                    "summary": "I appreciate you sharing this article, but I'm unable to provide a meaningful summary based on the information provided. The title and snippet are incomplete and unclear—it appears the headline got cut off (\"In Kiev kan je gaan smullen in ...restaurant Antwerpen\"), making it impossible to determine which specific restaurant is being discussed or what the actual news is about.\n\nTo help you, could you provide the full article text or a more complete headline? That way I can give you an accurate, concise summary focusing on the restaurant, the news, and why visitors would care."
                },
                {
                    "title": "Dit restaurant op het Zuid heeft een sterke identiteit: hier krijg je minimalisme op je bord en in het interieur - GVA",
                    "source": "GVA",
                    "url": "https://news.google.com/rss/articles/CBMilgJBVV95cUxPWmFRRzFSTENhWjRwRzFGY0Q2akp6OGFPLVZWNHVkOXg1UkJ4R0JWM2VKQTB1N3I2X2JzamFadW5mU2xmZF9VTDBSV19waDZSV2VDN3lRSkdQUEswY0tia0xfb29iclMyLUpNSWVvXzROYXEySHJ4a3lMMjNmb0FURmlYUlJUTmVKSVdKdmVHdHR1blN4T0RHVWRHRnZsMVYxZDAyUmdQejdFUk1aQ0ZTZnVkREdqUmY5Y29LNm9iYjJJWFRaUDVuX1JKUG50SF8xQTkweXpCaXRWVVg3cFp2MGt0b0tqVHdsdnlINnNVajByMDY5ckx3azJjaEJZcTNnMjU2dEVva2hYWk1DUHQyQTNXLVZIQQ?oc=5",
                    "publishedAt": "2026-02-14T09:00:00.000Z",
                    "language": "nl",
                    "summary": "I appreciate your request, but I'm unable to provide a full summary because the article snippet provided only contains the headline and source information—not the actual article content. To give you a practical 2-3 sentence summary focusing on the restaurant name, what makes it special, and why visitors should care, I would need access to the full article text.\n\nWhat I can tell you is that the headline indicates there's a minimalist restaurant in the Zuid neighborhood (likely Antwerp or Amsterdam) with a strong identity reflected in both its cuisine and interior design—which would appeal to visitors seeking a distinctive dining experience."
                }
            ]
        },
        "lisbon": {
            "places": [],
            "news": [
                {
                    "title": "Copo a copo: os melhores bares de vinho em Lisboa - Time Out Lisboa",
                    "source": "Time Out Lisboa",
                    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPTFI0ZDM1NXdLaVNtTE1zS3VYZGZ2QUtyRzRFa1lwWlgxb3c4TVpqa3FrVW5CYlNScmdGVW9JVFo0U3d2b21rT2ZBSDZUZS15ckg5bmQ0VW85T0w2cTJZMWdncUI1SHZPOVVHTXJqVkJ5VUhMWDM1ODg5c18xT1BIbQ?oc=5",
                    "publishedAt": "2026-02-16T00:00:00.000Z",
                    "language": "pt",
                    "summary": "I appreciate your request, but I'm unable to summarize the article since only the title and source information were provided—not the actual article content. \n\nTo give you a useful 2-3 sentence summary focused on the specific wine bars mentioned, the reasons to visit them, and why they matter to tourists in Lisbon, I would need the full article text or detailed snippet.\n\nIf you can share the article body, I'd be happy to create that concise summary for you!"
                },
                {
                    "title": "Dia 1: uma viagem aos bastidores do novo restaurante Henrique Sá Pessoa em Lisboa - Expresso",
                    "source": "Expresso",
                    "url": "https://news.google.com/rss/articles/CBMikAJBVV95cUxOcUc1WThHaXBKQU5oY2VMVE9kTU9uZFllNDNLSU93bjFPYVpfd2t5REtKd3hfTzJ3bThmMTdfU0FMSVBtT01TaHQ3emM2VDM3RTVaV3BLV3NzQlZieXJ4RVpjNE1pX1VqZ0NPLXBTS2VTWkJtOVdDam1Yc0V5eXYyemV0enFicTFjMWgyTF9tcEtadzI3SjlLNkZENDhiSG1VRHBodkhpR0swM2RDTDdfNVRCZjBMTlM2d2lCTVh2dDU2MUdLVms0V2NMVzlRcVJ0a0Vpa2E1MDVNSVBCRG1NRi1nQXdlQVNfVDQ2T2FKRHB6czFUSHgtVlpETXR5V0FOY2FNMi14SmVqRXJEOHl4Nw?oc=5",
                    "publishedAt": "2026-02-18T17:02:46.000Z",
                    "language": "pt",
                    "summary": "I don't have access to the full article content, only the title and snippet provided. However, based on what's available:\n\n**Summary:** The article is a behind-the-scenes look at the opening day of a new restaurant by chef Henrique Sá Pessoa in Lisbon. Visitors to Lisbon would care because Henrique Sá Pessoa is a renowned Portuguese chef, making this new dining establishment a noteworthy culinary destination worth experiencing.\n\n*(To provide a more detailed summary with specific offerings, location details, or opening information, I would need access to the full article text.)*"
                },
                {
                    "title": "Henrique Sá Pessoa abriu o seu restaurante no Páteo Bagatela - Público",
                    "source": "Público",
                    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPN0JDaGlQaUtiV1FYNWIxMFFzWmNKZXBVOGdDa3NZemo5NW42NXFGNkE5WGlnTkVYVnRxSnFHQU82RXd2TVVsUklBaDRrbVNza2ZxUmgwN2R3c3ZjWVFiZWYzWW1sZUFKYUZjZ2hxVUxybXJ2dEVndWZSZmtnS3ZsZV9aMDE2UGpleTgyNWdlYUY3bm5FTDJhQUduaUV6Q21aQ0VNbHV6UEV0bDQ?oc=5",
                    "publishedAt": "2026-02-19T15:20:13.000Z",
                    "language": "pt",
                    "summary": "# Summary\n\nRenowned chef Henrique Sá Pessoa has opened a new restaurant at Páteo Bagatela. Visitors to the city should care because Sá Pessoa is a celebrated chef, making this a notable dining destination for those seeking high-quality cuisine in a newly established venue."
                },
                {
                    "title": "Incêndio no Clube Naval de Lisboa leva a evacuação do edifício - Diário de Notícias",
                    "source": "Diário de Notícias",
                    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNSkdHZGRFSXpJQ05pUTVXcUpKU0JST012TWxYU0dEM3JGZ1NzcGNyeDZvNk9ybmV4UDhrdm52cnNiejh2bl9rSTJFMmw4YnRweWZIYWp5T3FNWW0yMDJMSVEzRkdfLTdmdUJsS1J6dFVremZ5NDUtNzNUMzhJdWlpVUV1T2lQdmVGUk5BQ05pYw?oc=5",
                    "publishedAt": "2026-02-19T21:20:04.000Z",
                    "language": "pt",
                    "summary": "I appreciate you sharing this, but this article is actually about a **fire at the Naval Club in Lisbon**, not restaurant/food news. The headline indicates an emergency evacuation due to a fire at a building (Clube Naval de Lisboa), which is a civic emergency rather than food-related content.\n\nIf you have a restaurant or food news article you'd like summarized, I'd be happy to help with that instead!"
                },
                {
                    "title": "Galeria Visit Brasil chega a Lisboa com exposição, cinema, música e gastronomia - Revista EntreRios",
                    "source": "Revista EntreRios",
                    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxQN1BCQlQ0cTJVQ2lxZEd4ZEpZU1JrbWFJbFRNT04wZTB0ODJBZXJGdjlqdzBUdnFDeXRlTGNoaVBUM09EQ2lxMXUzY1MxQm5ETDd5amkyRXVOekV1Vk90MFRQX0RUdGFJWjItTm1uLWFMbjBzUVpncGo5UkZDbTRpMDM0blJMYWNNUEViTVVXMHpybk1LdVYwenk5Sk1yWXpYRkVUYVVhZ2RyVVI0SXRZYkRPdWU5RGc?oc=5",
                    "publishedAt": "2026-02-19T17:01:49.000Z",
                    "language": "pt",
                    "summary": "# Summary\n\nVisit Brasil Gallery has opened in Lisbon, offering an immersive cultural experience that combines art exhibitions, cinema, music, and Brazilian gastronomy. Visitors to Lisbon can explore Brazilian culture and cuisine in one destination, making it an ideal spot for those interested in experiencing Brazilian food and entertainment without traveling to Brazil. The venue provides a unique cultural hub that blends multiple artistic and culinary experiences."
                }
            ]
        },
        "newcastle": {
            "places": [],
            "news": [
                {
                    "title": "New bar to replace The Mushroom in Newcastle weeks after famous party spot shut down - Chronicle Live",
                    "source": "Chronicle Live",
                    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQZWNzRlM1MWZSOWtVb3hSV1pXU09GM0xQYjU5VURpblNoSXFqR3NTSWV6cm5HQWVUelM5dXFWZkxFdTd4NGxxUTZQUUwtNHBDUFFYNXRwWG92clJrOURxS05nLWhBQWgxLWw5NElFYjhzQjNCQkJIRlVMZzB3RXZFcjlLS19WT2F1d0hXbXBEaTNPNjc2Rmh4bmJXYnJpZVZzRkdtRGRiN0ZxWGvSAbABQVVfeXFMTjdnZTZ2SzlnZlZwd285WWxLMThUeWNSNm9FUkI1amhJaFJLckxjajcxR3NUOHFYdmE1Wkd2V1JrRGxDQmxXMFhyOG5yVEhUbGc0bHZlV0dobHpKc0U2QWtQTlQ2SEhNZ1BwdlNneVNHQzlFUmZnSFo3MERrLTR2Z0FfSlNYUlNQQ1NWV1B4NGNFSGItQXlIM0hiVEV3WlMwb3U2bTN3bk11TUthelFTMGk?oc=5",
                    "publishedAt": "2026-02-19T18:25:00.000Z",
                    "language": "en",
                    "summary": "# Summary\n\nA new bar is set to open in Newcastle at the location of The Mushroom, a well-known nightlife venue that recently closed. This development would interest visitors to Newcastle because it signals the quick revival of a popular party spot in the city's entertainment district. The new establishment offers an opportunity for locals and tourists to continue enjoying the nightlife scene at this central venue."
                },
                {
                    "title": "North East crazy golf venue transformed into sports bar after six-figure refurb - The Northern Echo",
                    "source": "The Northern Echo",
                    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxOZ0VlajdPM1BESk8yd1o5NFIyOEItbnA5cFd6TTRnRHVCOG9KVElmaF9yX1hNY2xSNmNfQ3pKQUpRRzBlbW5tcVdxTHJBd0ExYXUxSUp1Q1p3SktXV0YyZDBWc3BRNVItcnhpTDlfYUlVOXJlTDhWZUVCZG5RMDgtdDdGb3BGMVFvWGI1Uy1PSjBsQXZ4YzdEczNLUFhzUQ?oc=5",
                    "publishedAt": "2026-02-20T12:00:00.000Z",
                    "language": "en",
                    "summary": "# Summary\n\nA crazy golf venue in the North East has undergone a six-figure renovation to become a sports bar. Visitors to the region looking for entertainment and food/drink options now have a new venue combining sports viewing with dining and drinks. The transformation represents a significant investment in the local hospitality scene, making it a notable addition for tourists and locals seeking casual entertainment spots."
                },
                {
                    "title": "Where to Eat and Drink Near St James’ Park 2026: Best Pubs and Restaurants For Fans - Football Ground Guide",
                    "source": "Football Ground Guide",
                    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPV25mbXYyU25xazlvcVpidHY5UC1GR3lZZDdYS3RhdzVCOXlFQ1ZiZTBzWVhieEZWOVp1QzNxWVN5dldXM0pkNUs0TmlHTzJtd3gyOVJ0cjRWa0l4UDc3MnVNMmZpU3FzNWozcUlFZWlla1l3WE91NC1OQ2llMENLS2tWTjdMbnhkNUY4Ml9VUmVvQTFTbTVhMTRKaF9UZEJrbGd6Nmt3NlNyeWdEQVJwUWpuVm93YllnTlE?oc=5",
                    "publishedAt": "2026-02-19T14:54:18.000Z",
                    "language": "en",
                    "summary": "# Summary\n\nThis article guides visitors to St James Park (Newcastle United's football stadium) to the best nearby pubs and restaurants for fans attending matches in 2026. The piece provides practical dining recommendations in the area surrounding the stadium. Visitors to Newcastle for match days would find this useful for planning where to eat and drink before or after games."
                },
                {
                    "title": "Inside Newcastle fans' 2,529-mile journey to Qarabag where the beer is 'cheap as owt': An army of 2,000 Magpies supporters are making the trip to 'ridiculously cheap' Azerbaijan - and partying on two hours of sleep! - Daily Mail",
                    "source": "Daily Mail",
                    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxQY0hOTVljVVozT0xrTnVoZTYwSml2SzhYX0RxQTBnRE5XNmZWVVpJblV0YkFEWmFFVkM5cWEwaklWRDZMYnVyWXNrRlZOSGRtWk5sdW93VWpiMnBDWEljTU5rR2c1ZzJYRmFNTklyQlJaUUhUd3FpamhwdENOTnFBRTJCRFRoWjhMUGkyd1czRzdDZlM3YWJIN1NrSG1QMEZZQU9DTVNTemJvMlczcGdBLdIBtgFBVV95cUxNSHYxbzN0dldIZlNWTXd2NXJCU2FwdndRLVlobS1vQkRvcE1rOWZEQWI1ODNfcDVsdDliSmlvQzg2a01wckZLQ0NKX2NNeW8tYVRJQ3NfajBuT3IzckN3UTlFRFhsQW1NSEgwZ3czZGpNSk1rQ1BLMFhBaGZFRVl1TVR6VFhVSWVfZk10UkJ4YnRyNGZIZ25obC05MzlVb0s5am1zemxvTVNNdzM5b2tGb0NBbl9WZw?oc=5",
                    "publishedAt": "2026-02-17T17:57:30.000Z",
                    "language": "en",
                    "summary": "This article covers Newcastle United fans traveling 2,529 miles to Azerbaijan for a match against Qarabag, with approximately 2,000 supporters making the trip. A key attraction for visitors is that food and beverages, particularly beer, are exceptionally affordable in Azerbaijan compared to UK prices. For anyone traveling to the region, this highlights that Baku and surrounding areas offer significant cost savings on dining and drinks despite the long journey."
                },
                {
                    "title": "Historic Newcastle city centre bank to be transformed into high-end restaurant - Chronicle Live",
                    "source": "Chronicle Live",
                    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPRUdwRll6Sm5fSTE0elJtY3FYWE9qaTlvNmhHZEx4STZTNWtJTVRIUHc1WjNnZ1NwRXJ5NnZ1eWZQRjZjb1NGaGRYcjJtZl9VcWZUN0M4ZllseDl1RS1nOFp1SVdOZjR5bVpqUTVoTEdYUEl6dlJaTlo1ZzJ5LTg1TENjY09JWjRaTmlzUlFfNVdpYTJJU0s1Vnc5WjFOZE83YmZJ0gGoAUFVX3lxTE00TlpvNVB5SEtubFJqVXJuR0dHa3dqYTlLN3lUQUMzYk9BVUlqZTBBWlFTUlpUQWJ6SnlpMkxMdF9iNk92VUZGeXl0SUNRZU9BeDdWM1dRaXpteV9waVV4TUNETm1zMElXTVlrZG5vbVNfT2s3M0lQWmtzR29VeTNtMXpSMWNuQTV4WFROb1RoaHJ4cHFvX3ktQjBNUzhMRzFGblB0LVVUUQ?oc=5",
                    "publishedAt": "2026-02-18T15:54:00.000Z",
                    "language": "en",
                    "summary": "I don't have access to the full article content beyond the title and snippet you've provided. To give you an accurate 2-3 sentence summary with specific details about the restaurant concept, location benefits, and why visitors should care, I would need the complete article text.\n\nCould you share the full article, or would you like me to summarize based only on what's in the headline—that a historic bank building in Newcastle city centre is being converted into a high-end restaurant?"
                }
            ]
        },
        "tallinn": {
            "places": [],
            "news": [
                {
                    "title": "Your Tallinn hit list: the top 5 events this week - Estonian World",
                    "source": "Estonian World",
                    "url": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOMDUzQ0xBdU1wOThsUWROdGlid2tCQWNWWGtwLWNfMjFpbDNfZzlxX3hKczB3WjIxZzRjcDI2aXVlbnNlTldMN2VRUjJ3RThuMDVYQ0lfeENNcmNLT3hPcG1wRHRSOGU0U3J4ZGk4SWRTMlFaY0NVdFlKRllCWEd6RnFFM2VvNXJCeHNoSlIxSQ?oc=5",
                    "publishedAt": "2026-02-16T18:08:16.000Z",
                    "language": "en",
                    "summary": "I'd be happy to help summarize the article, but the snippet you've provided only contains the title and source information—not the actual article content. To give you an accurate 2-3 sentence summary focusing on the specific restaurants/food events mentioned and their relevance to visitors, I would need the full article text or a more detailed snippet.\n\nCould you please share the complete article or more of its content?"
                }
            ]
        }
    }
}